node {
  name: "Input_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 7
        }
        dim {
          size: 19
        }
        dim {
          size: 19
        }
      }
    }
  }
}
node {
  name: "Input/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\007\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "Input/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.058140188455581665
      }
    }
  }
}
node {
  name: "Input/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.058140188455581665
      }
    }
  }
}
node {
  name: "Input/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Input/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Input/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Input/kernel/Initializer/random_uniform/max"
  input: "Input/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
}
node {
  name: "Input/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Input/kernel/Initializer/random_uniform/RandomUniform"
  input: "Input/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
}
node {
  name: "Input/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Input/kernel/Initializer/random_uniform/mul"
  input: "Input/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
}
node {
  name: "Input/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 7
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Input/kernel/Assign"
  op: "Assign"
  input: "Input/kernel"
  input: "Input/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Input/kernel/read"
  op: "Identity"
  input: "Input/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
}
node {
  name: "Input/bias/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 64
      }
    }
  }
}
node {
  name: "Input/bias/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Input/bias/Initializer/zeros"
  op: "Fill"
  input: "Input/bias/Initializer/zeros/shape_as_tensor"
  input: "Input/bias/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/bias"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Input/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Input/bias/Assign"
  op: "Assign"
  input: "Input/bias"
  input: "Input/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Input/bias/read"
  op: "Identity"
  input: "Input/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/bias"
      }
    }
  }
}
node {
  name: "Input/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Input/Conv2D"
  op: "Conv2D"
  input: "Input_input"
  input: "Input/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "Input/BiasAdd"
  op: "BiasAdd"
  input: "Input/Conv2D"
  input: "Input/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NCHW"
    }
  }
}
node {
  name: "flatten/Shape"
  op: "Shape"
  input: "Input/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "flatten/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "flatten/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "flatten/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "flatten/strided_slice"
  op: "StridedSlice"
  input: "flatten/Shape"
  input: "flatten/strided_slice/stack"
  input: "flatten/strided_slice/stack_1"
  input: "flatten/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "flatten/Reshape/shape/1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "flatten/Reshape/shape"
  op: "Pack"
  input: "flatten/strided_slice"
  input: "flatten/Reshape/shape/1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "flatten/Reshape"
  op: "Reshape"
  input: "Input/BiasAdd"
  input: "flatten/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Output/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@8\000\000i\001\000\000"
      }
    }
  }
}
node {
  name: "Output/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.020161263644695282
      }
    }
  }
}
node {
  name: "Output/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.020161263644695282
      }
    }
  }
}
node {
  name: "Output/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Output/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Output/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Output/kernel/Initializer/random_uniform/max"
  input: "Output/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
}
node {
  name: "Output/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Output/kernel/Initializer/random_uniform/RandomUniform"
  input: "Output/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
}
node {
  name: "Output/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Output/kernel/Initializer/random_uniform/mul"
  input: "Output/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
}
node {
  name: "Output/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 14400
        }
        dim {
          size: 361
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Output/kernel/Assign"
  op: "Assign"
  input: "Output/kernel"
  input: "Output/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Output/kernel/read"
  op: "Identity"
  input: "Output/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
}
node {
  name: "Output/bias/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 361
      }
    }
  }
}
node {
  name: "Output/bias/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Output/bias/Initializer/zeros"
  op: "Fill"
  input: "Output/bias/Initializer/zeros/shape_as_tensor"
  input: "Output/bias/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/bias"
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Output/bias"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/bias"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 361
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Output/bias/Assign"
  op: "Assign"
  input: "Output/bias"
  input: "Output/bias/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Output/bias/read"
  op: "Identity"
  input: "Output/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/bias"
      }
    }
  }
}
node {
  name: "Output/MatMul"
  op: "MatMul"
  input: "flatten/Reshape"
  input: "Output/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Output/BiasAdd"
  op: "BiasAdd"
  input: "Output/MatMul"
  input: "Output/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "Output/Softmax"
  op: "Softmax"
  input: "Output/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "TFOptimizer/iterations/Initializer/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "TFOptimizer/iterations"
  op: "VarHandleOp"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "TFOptimizer/iterations"
    }
  }
}
node {
  name: "TFOptimizer/iterations/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "TFOptimizer/iterations"
}
node {
  name: "TFOptimizer/iterations/Assign"
  op: "AssignVariableOp"
  input: "TFOptimizer/iterations"
  input: "TFOptimizer/iterations/Initializer/initial_value"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@TFOptimizer/iterations"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "TFOptimizer/iterations/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "TFOptimizer/iterations"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@TFOptimizer/iterations"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "Output_target"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "Output_sample_weights/input"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Output_sample_weights"
  op: "PlaceholderWithDefault"
  input: "Output_sample_weights/input"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
      }
    }
  }
}
node {
  name: "loss/Output_loss/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "loss/Output_loss/Sum"
  op: "Sum"
  input: "Output/Softmax"
  input: "loss/Output_loss/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "loss/Output_loss/truediv"
  op: "RealDiv"
  input: "Output/Softmax"
  input: "loss/Output_loss/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0000000116860974e-07
      }
    }
  }
}
node {
  name: "loss/Output_loss/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "loss/Output_loss/sub"
  op: "Sub"
  input: "loss/Output_loss/sub/x"
  input: "loss/Output_loss/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/clip_by_value/Minimum"
  op: "Minimum"
  input: "loss/Output_loss/truediv"
  input: "loss/Output_loss/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/clip_by_value"
  op: "Maximum"
  input: "loss/Output_loss/clip_by_value/Minimum"
  input: "loss/Output_loss/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/Log"
  op: "Log"
  input: "loss/Output_loss/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/mul"
  op: "Mul"
  input: "Output_target"
  input: "loss/Output_loss/Log"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/Sum_1/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "loss/Output_loss/Sum_1"
  op: "Sum"
  input: "loss/Output_loss/mul"
  input: "loss/Output_loss/Sum_1/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "loss/Output_loss/Neg"
  op: "Neg"
  input: "loss/Output_loss/Sum_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/Mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "loss/Output_loss/Mean"
  op: "Mean"
  input: "loss/Output_loss/Neg"
  input: "loss/Output_loss/Mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "loss/Output_loss/mul_1"
  op: "Mul"
  input: "loss/Output_loss/Mean"
  input: "Output_sample_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/NotEqual/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "loss/Output_loss/NotEqual"
  op: "NotEqual"
  input: "Output_sample_weights"
  input: "loss/Output_loss/NotEqual/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/Cast"
  op: "Cast"
  input: "loss/Output_loss/NotEqual"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "loss/Output_loss/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "loss/Output_loss/Mean_1"
  op: "Mean"
  input: "loss/Output_loss/Cast"
  input: "loss/Output_loss/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "loss/Output_loss/truediv_1"
  op: "RealDiv"
  input: "loss/Output_loss/mul_1"
  input: "loss/Output_loss/Mean_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "loss/Output_loss/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "loss/Output_loss/Mean_2"
  op: "Mean"
  input: "loss/Output_loss/truediv_1"
  input: "loss/Output_loss/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "loss/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "loss/mul"
  op: "Mul"
  input: "loss/mul/x"
  input: "loss/Output_loss/Mean_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "metrics/acc/ArgMax/dimension"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "metrics/acc/ArgMax"
  op: "ArgMax"
  input: "Output_target"
  input: "metrics/acc/ArgMax/dimension"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "output_type"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "metrics/acc/ArgMax_1/dimension"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "metrics/acc/ArgMax_1"
  op: "ArgMax"
  input: "Output/Softmax"
  input: "metrics/acc/ArgMax_1/dimension"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "output_type"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "metrics/acc/Equal"
  op: "Equal"
  input: "metrics/acc/ArgMax"
  input: "metrics/acc/ArgMax_1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "metrics/acc/Cast"
  op: "Cast"
  input: "metrics/acc/Equal"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "metrics/acc/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "metrics/acc/Mean"
  op: "Mean"
  input: "metrics/acc/Cast"
  input: "metrics/acc/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "group_deps"
  op: "NoOp"
  input: "^Output/Softmax"
}
node {
  name: "IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "Input/kernel"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "IsVariableInitialized_1"
  op: "IsVariableInitialized"
  input: "Input/bias"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Input/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "IsVariableInitialized_2"
  op: "IsVariableInitialized"
  input: "Output/kernel"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "IsVariableInitialized_3"
  op: "IsVariableInitialized"
  input: "Output/bias"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Output/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "TFOptimizer/iterations"
}
node {
  name: "init"
  op: "NoOp"
  input: "^Input/kernel/Assign"
  input: "^Input/bias/Assign"
  input: "^Output/kernel/Assign"
  input: "^Output/bias/Assign"
  input: "^TFOptimizer/iterations/Assign"
}
node {
  name: "training/TFOptimizer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "training/TFOptimizer/AssignAddVariableOp"
  op: "AssignAddVariableOp"
  input: "TFOptimizer/iterations"
  input: "training/TFOptimizer/Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "training/TFOptimizer/ReadVariableOp"
  op: "ReadVariableOp"
  input: "TFOptimizer/iterations"
  input: "^training/TFOptimizer/AssignAddVariableOp"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/grad_ys_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/Fill"
  op: "Fill"
  input: "training/TFOptimizer/gradients/Shape"
  input: "training/TFOptimizer/gradients/grad_ys_0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/mul_grad/Mul"
  op: "Mul"
  input: "training/TFOptimizer/gradients/Fill"
  input: "loss/Output_loss/Mean_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/mul_grad/Mul_1"
  op: "Mul"
  input: "training/TFOptimizer/gradients/Fill"
  input: "loss/mul/x"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/mul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/TFOptimizer/gradients/loss/mul_grad/Mul"
  input: "^training/TFOptimizer/gradients/loss/mul_grad/Mul_1"
}
node {
  name: "training/TFOptimizer/gradients/loss/mul_grad/tuple/control_dependency"
  op: "Identity"
  input: "training/TFOptimizer/gradients/loss/mul_grad/Mul"
  input: "^training/TFOptimizer/gradients/loss/mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@training/TFOptimizer/gradients/loss/mul_grad/Mul"
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/mul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "training/TFOptimizer/gradients/loss/mul_grad/Mul_1"
  input: "^training/TFOptimizer/gradients/loss/mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@training/TFOptimizer/gradients/loss/mul_grad/Mul_1"
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Reshape"
  op: "Reshape"
  input: "training/TFOptimizer/gradients/loss/mul_grad/tuple/control_dependency_1"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Shape"
  op: "Shape"
  input: "loss/Output_loss/truediv_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Tile"
  op: "Tile"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Reshape"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Shape_1"
  op: "Shape"
  input: "loss/Output_loss/truediv_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Shape_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Prod"
  op: "Prod"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Shape_1"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Prod_1"
  op: "Prod"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Shape_2"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Const_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Maximum/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Maximum"
  op: "Maximum"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Prod_1"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Maximum/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/floordiv"
  op: "FloorDiv"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Prod"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Maximum"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Cast"
  op: "Cast"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/floordiv"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/truediv"
  op: "RealDiv"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Tile"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/Cast"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Shape"
  op: "Shape"
  input: "loss/Output_loss/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Shape"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/RealDiv"
  op: "RealDiv"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/truediv"
  input: "loss/Output_loss/Mean_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Sum"
  op: "Sum"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/RealDiv"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Reshape"
  op: "Reshape"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Sum"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Neg"
  op: "Neg"
  input: "loss/Output_loss/mul_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/RealDiv_1"
  op: "RealDiv"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Neg"
  input: "loss/Output_loss/Mean_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/RealDiv_2"
  op: "RealDiv"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/RealDiv_1"
  input: "loss/Output_loss/Mean_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/mul"
  op: "Mul"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_2_grad/truediv"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/RealDiv_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Sum_1"
  op: "Sum"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/mul"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Reshape_1"
  op: "Reshape"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Sum_1"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Reshape"
  input: "^training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Reshape_1"
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/tuple/control_dependency"
  op: "Identity"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Reshape"
  input: "^training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Reshape"
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Reshape_1"
  input: "^training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Shape"
  op: "Shape"
  input: "loss/Output_loss/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Shape_1"
  op: "Shape"
  input: "Output_sample_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Shape"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Mul"
  op: "Mul"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/tuple/control_dependency"
  input: "Output_sample_weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Sum"
  op: "Sum"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Mul"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Reshape"
  op: "Reshape"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Sum"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Mul_1"
  op: "Mul"
  input: "loss/Output_loss/Mean"
  input: "training/TFOptimizer/gradients/loss/Output_loss/truediv_1_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Sum_1"
  op: "Sum"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Mul_1"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Reshape_1"
  op: "Reshape"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Sum_1"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/tuple/group_deps"
  op: "NoOp"
  input: "^training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Reshape"
  input: "^training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Reshape_1"
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/tuple/control_dependency"
  op: "Identity"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Reshape"
  input: "^training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Reshape"
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Reshape_1"
  input: "^training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@training/TFOptimizer/gradients/loss/Output_loss/mul_1_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_grad/Shape"
  op: "Shape"
  input: "loss/Output_loss/Neg"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_grad/Size"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@training/TFOptimizer/gradients/loss/Output_loss/Mean_grad/Shape"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "training/TFOptimizer/gradients/loss/Output_loss/Mean_grad/add"
  op: "Add"
  input: "loss/Output_loss/Mean/reduction_indices"
  input: "training/TFOptimizer/gradients/loss/Output_loss/Mean_grad/Size"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@training/TFOptimizer/gradients/loss/Output_loss/Mean_grad/Shape"
      }
    }
  }
}
node {
